// - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).

// let time  =  prompt('Введіть число');
// if (time < 15 ){
//     console.log('Перший Квадрант');
// }else if (time > 15 && time <= 30) {
//     console.log('Другий Квадрант');
// }else if (time > 30 && time <= 45){
//     console.log('Третій Квадрант');
// }else if (time > 45 && time <= 59){
//     console.log('Четверий Квадрант');
// }

// - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).

// let day = prompt('Номер дня в місяці');
//
// if (day <= 10) {
//     console.log('Перша Декада');
// } else if (day >= 10 && day <= 20) {
//     console.log('Друга Декада');
// } else if (day >= 20 && day <= 31){
//     console.log('Третя Декада');
// }

// - У нас є змінна test не дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
//     Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)

// let test = false
// if (test === true) {
//     document.write(`<div>Вірно</div>`)
// }else if (test === false){
//     console.error('Невірно');
// }
// console.log(!test);

// - Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3

// let a = 0;
// let a = 1;
// let a = -3;
// const a = prompt('Your number')
// if (a != 0){
//     console.log('Вірно');
// }else {
//     console.log('Невірно');
// }

// - Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день.
// const  days = +prompt('Введіть день');
// switch (days) {
//     case(1):
//         console.log('Понеділок Встати з ранку піти на роботу купити кави і готуватись до лекції в Okten');
//         break
//     case(2):
//         console.log('Вівторок Піти на Англ, Піти на Роботу, Піти на найкращу Практику в Okten');
//         break
//     case (3):
//         console.log('Середа Невже це средина тижня, але Лекція в Сергія Це закон');
//         break
//     case (4) :
//         console.log('Четвер Ще один день І П*ятниця');
//         break
//     case(5):
//         console.log('П*ятниця Лекція Понад усе, а тоді можна і по пивку');
//         break
//     case (6):
//         console.log('Субота треба прибрати хату і До Руслана на Англійську,а тоді вправлятись і ввечері на кіно');
//         break
//     case (7):
//         console.log('Неділя Готуємось до наступного тижня, тому треба виспатись');
//         break
//     default : 'Днів в тижні тільки 7 Карл'
// }
//     - Потрібно визначити Високосний рік чи ні. Високосні роки діляться націло на 4.

// const year = +prompt('Input days per Year');
// if (year % 4 === 2) {
//     console.log('Congratulation Year Is Високосний');
// } else if (year % 3 === 2) {
//     console.error('Dam Son!!! We have a problem');
// }
//     - Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!

// let js  = prompt('Яка «офіційна» назва JavaScript?');
// if (js === 'ECMAScript' ){
//     console.log('Правильно!');
// } else if (js){
//     console.log('Не знаєте? ECMAScript!');
// }
