// - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).

// let time  =  prompt('Введіть число');
// if (time < 15 ){
//     console.log('Перший Квадрант');
// }else if (time > 15 && time <= 30) {
//     console.log('Другий Квадрант');
// }else if (time > 30 && time <= 45){
//     console.log('Третій Квадрант');
// }else if (time > 45 && time <= 59){
//     console.log('Четверий Квадрант');
// }

// - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).

// let day = prompt('Номер дня в місяці');
//
// if (day <= 10) {
//     console.log('Перша Декада');
// } else if (day >= 10 && day <= 20) {
//     console.log('Друга Декада');
// } else if (day >= 20 && day <= 31){
//     console.log('Третя Декада');
// }

// - У нас є змінна test не дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
//     Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)

let test = false
// if (test === true) {
//     document.write(`<div>Вірно</div>`)
// }else if (test === false){
//     console.error('Невірно');
// }
let ternar
console.log();

